Revit 2027 API
View.IsolateCategoryTemporary Method
 Set one category to be temporarily isolated in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void IsolateCategoryTemporary(
	ElementId elementId
)
Public Sub IsolateCategoryTemporary (
	elementId As ElementId
)
public:
void IsolateCategoryTemporary(
	ElementId^ elementId
)
member IsolateCategoryTemporary :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 Id of category to be isolated.
Exceptions
Exception | Condition
ArgumentException |  elementId does not correspond to a Category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace